init.el

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package general
:after evil
:config
  ;; (general-evil-setup)
  ;; set up 'SPC' as the global leader key
  (general-create-definer leader-bind
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode
  (leader-bind
      "b"  '(:ignore t                          :wk "Buffer")
      "bb" '(switch-to-buffer                   :wk "Switch buffer")
      "bd" '(kill-this-buffer                   :wk "Delete buffer")
      "bn" '(next-buffer                        :wk "Next buffer")
      "bp" '(previous-buffer                    :wk "Prev buffer")
      "br" '(revert-buffer                      :wk "Reload buffer")
      "]"  '(next-buffer                        :wk "Next buffer")
      "["  '(previous-buffer                    :wk "Prev buffer")

      "w"  '(:ignore t                          :wk "Window")
      "wd" '(delete-window                      :wk "Delete window")
      "wv" '(split-window-vertically            :wk "Vertical split")
      "wh" '(split-window-horizontally          :wk "Horizontal split")
      "wh" '(evil-window-left                   :wk "window <")
      "wj" '(evil-window-down                   :wk "window v")
      "wk" '(evil-window-up                     :wk "window ^")
      "wl" '(evil-window-right                  :wk "window >")
  )
)

(use-package which-key
  :init
  (which-key-mode 1)
  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-idle-secondary-delay 0.05
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " → "
  )
)

(use-package evil-org)

(use-package org-roam
:after org
:init
  (setq org-roam-directory (file-truename "~/roam"))
  (setq org-roam-v2-ack t)
)

  (use-package org-superstar
    :hook (org-mode . org-superstar-mode)
    :init
    ;; (setq org-superstar-headline-bullets-list '("✖" "✚" "◉" "○" "▶")
	  ;; org-superstar-special-todo-items t
	  ;; org-ellipsis " ↴ ")
  )

(use-package org-fancy-priorities)

;; (use-package org-pandoc)

(use-package dirvish
    :init (dirvish-override-dired-mode)
)

(use-package eaf
;; :load-path "~/.emacs.d/site-lisp/emacs-application-framework"
:custom
  ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
  (eaf-browser-continue-where-left-off t)
  (eaf-browser-enable-adblocker t)
  (browse-url-browser-function 'eaf-open-browser)
:config
  (defalias 'browse-web #'eaf-open-browser)
  ;; (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
  ;; (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
  ;; (eaf-bind-key take_photo "p" eaf-camera-keybinding)
  ;; (eaf-bind-key nil "M-q" eaf-browser-keybinding)
) ;; unbind, see more in the Wiki

(use-package eaf-browser)       ;;M-x eaf-file-browser-qrcode
(use-package eaf-git)       ;;M-x eaf-file-browser-qrcode
(use-package eaf-file-manager)  ;;M-x eaf-open-in-file-manager
(use-package eaf-pdf-viewer)

(setq gc-cons-threshold (* 2 1000 1000))
